dev/singleBuilding/of7_kEpsilon/system/fvSchemes
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

// Gradient terms
gradSchemes
{
    default         Gauss linear;
}

// Convection terms
divSchemes
{
    default                             none;

    div(phi,U)                          bounded Gauss upwind;
    div(phi,k)                          bounded Gauss upwind;
    div(phi,epsilon)                    bounded Gauss upwind;
    div(phi,omega)                      bounded Gauss upwind;

    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}

// Diffusive terms
laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
